app/Commons/Common.php

insert into `log_ips` (`ip`, `screen`, `status`, `created_at`) values ('127.0.0.1', 'Register', 1, '2021-06-02 06:48:18')
---
    public static function logip($ip, $screen, $status){
        $values = array('ip' => $ip,'screen' => $screen, 'status' => $status, 'created_at'=>now());
        DB::table('log_ips')->insert($values);