app/Http/Controllers/AuthController.php

    public function register(Request $request)
    {
        try {
            $rules = array(
                "name" => "required|string",
                "email" => "required|email|unique:users",
                "password" => [
                    'required',
                    'string',
                    'min:6',             // must be at least 6 characters in length
                    'regex:/[a-z]/',      // must contain at least one lowercase letter
                    'regex:/[A-Z]/',      // must contain at least one uppercase letter
                    'regex:/[0-9]/',      // must contain at least one digit
                    'regex:/[@$!%*#?&]/', // must contain a special character
                ],
            );
            $validator = Validator::make($request->all(), $rules);
            if ($validator->fails()) {
                return response()->json([
                    "status" => ApiCode::VALIDATION_ERROR,
                    "user" => "Invalidation password"
                ]);
            }

            $user = new User();
            $user->name = $request->name;
            $user->email = $request->email;
            $user->password = bcrypt($request->password);
            $user->save();
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('zun1', 'tranvandung163@zenken.co.jp', 'y$b6liHXpGAZWJoyX4pXqkn.4z4sTvXdUzujNkqH6JpXTEL7PjgOv96', '2021-06-02 01:12:31', '2021-06-02 01:12:31')

    public function updateUser(Request $request, $id)
    {
        try {
            $userData = $request->all();
            $user     = User::find($id);
            if ($user == null) {
                $return = ['status' => ApiCode::BAD_REQUEST, 'message' => 'ユーザーが既存ではありません。'];
                return response()->json($return);
            }
            $user->update($userData);
---
update `users` set `name` = 'dung33333', `email` = 'dung33333@gmail.com', `users`.`updated_at` = '2021-06-02 08:05:04' where `id` = 3

    public function changePassword(Request $request)
    {
        $input = $request->all();
        $rules = array(
            'old_password' => 'required',
            'new_password' => [
                'required',
                'string',
                'min:6',             // must be at least 6 characters in length
                'regex:/[a-z]/',      // must contain at least one lowercase letter
                'regex:/[A-Z]/',      // must contain at least one uppercase letter
                'regex:/[0-9]/',      // must contain at least one digit
                'regex:/[@$!%*#?&]/', // must contain a special character
            ],
            'confirm_password' => 'required|same:new_password',
        );
        $validator = Validator::make($request->all(), $rules);
        if ($validator->fails()) {
            return response()->json(array("status" => ApiCode::BAD_REQUEST, "message" => $validator->errors()->first(), "data" => array()));
        } else {
            try {
                $user = JWTAuth::user();
                if ((Hash::check(request('old_password'), $user->password)) == false) {
                    return response()->json(array("status" => ApiCode::BAD_REQUEST, "message" => "Check your old password.", "data" => array()));
                } else if ((Hash::check(request('new_password'), $user->password)) == true) {
                    return response()->json(array("status" => ApiCode::BAD_REQUEST, "message" => "Please enter a password which is not similar then current password.", "data" => array()));
                } else {
                    $user->password = bcrypt($input['new_password']);
                    $user->save();
---
update `users` set `password` = 'ycxd0IaSAV7SqBsxuF.dz.GyiyL8HgIBVd713.L8aim4G6OUEw3J6', `users`.`updated_at` = '2021-06-02 08:19:19' where `id` = '{\"id\":1,\"name\":\"Dejon Kilback\",\"email\":\"tranvandung@zenken.co.jp\",\"email_verified_at\":\"2021-05-28T07:26:48.000000Z\",\"created_at\":\"2021-05-28T07:26:49.000000Z\",\"updated_at\":\"2021-06-02T05:09:56.000000Z\"}'